Revit 2026 API

# MEPSpaceConstruction Methods

---

The MEPSpaceConstruction type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DeleteConstruction | Remove an existing construction from Space constructions. |
|  | DuplicateConstruction | Create a new construction for Space constructions. |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | NewConstruction | Create a new construction for Space constructions. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

MEPSpaceConstruction Class

Autodesk.Revit.DB.Mechanical Namespace